{ "WeaponTriggerSettings" : {
    "trigger_threshold" : { "type": "uint", "default": 5, "description": "The input value that causes the weapon to fire. Range is 0-9 for the inputs, but only 3-8 are valid for trigger resistance." },
    "trigger_threshold_release" : { "type": "uint", "default": 4, "description": "The input value that causes the weapon to stop firing (Should be equal or less than the regular threshold)." },
    "resistance_strength_start" : { "type": "uint", "default": 3, "description": "The amount of resistance in the beginning." },
    "resistance_strength_end" : { "type": "uint", "default": 7, "description": "The amount of resistance at the end. 0 means no trigger effect!" },
    "vibration_amplitude" : { "type": "uint", "description": "The vibration strength once the trigger is past the threshold. 0 means off." },
    "vibration_frequency" : { "type": "uint", "description": "The vibration frequency once the trigger is past the threshold." },
    "vibration_frequency_variance" : { "type": "uint", "description": "The vibration frequency variance once the trigger is past the threshold." },
    "charge_up_vibration_frequency_start" : { "type": "uint", "description": "(Used by weapons that have spin up, charge, beam, etc) Replace the initial trigger resist with a vibration. This determines the vibration at 0% charge. 0 means off." },
    "charge_up_vibration_frequency_end" : { "type": "uint", "description": "(Used by weapons that have spin up, charge, beam, etc) Replace the initial trigger resist with a vibration strength. This determines the vibration at 100% charge." },
    "weight_resistance" : { "type": "uint", "default": 3, "description": "The amount of maximum resistance when aiming a weapon." },
    "double_action_trigger" : { "type": "uint", "description": "If above 0, will activate the single shot trigger. Number determines by how much to offset the regular trigger." },
    "double_action_regular_offset" : { "type": "uint", "description": "If double action is enabled, but we aren't in Full Auto, how much should the trigger threshold be offsetted by." },
    "on_fire_event" : { "type": "uint", "description": "[string]The name of the audio event to send to the trigger on every fire event (for rumble + controller audio)." }
}}
